docs/performance/2026-09-18/s3-before-k6.txt
# S3 before — 2026-09-18, k6 scripts/s3.js, 동시 30 고정 5분, 실패 주입 0, mock 지연 STT 3000ms + LLM 4500ms
# 서버: SPRING_PROFILES_ACTIVE=dev STT_ENABLED=false LLM_ENABLED=false STT_MOCK_DELAY_MS=3000 LLM_MOCK_DELAY_MS=4500 JAVA_TOOL_OPTIONS="-Xms2g -Xmx2g" ./gradlew bootRun (MySQL 8.0 임시 컨테이너 3307)
# 요약: 콤보 1,080건, 에러 0. answers p95 7.56s (사용자 1명 7.6s와 같음 — 동시 30에서 줄 안 섬), start p95 57ms.
#       GC 5분: Evacuation 5회/0.04s + Humongous Allocation 25회/0.18s, Full GC 0. Humongous = 오디오 byte[] 힙 적재 흔적(9/11 발견의 축소판).
#       해석: 동시 30은 동기 구조에 부담이 아니다(가상 스레드가 7.5s씩 잠들 뿐). 동기의 문제는 속도가 아니라 유실(S1)과 실패 시 사용자 재제출(S2).
# 원본 요약 JSON: s3-before.json



  █ TOTAL RESULTS 

    checks_total.......: 4320    14.002169/s
    checks_succeeded...: 100.00% 4320 out of 4320
    checks_failed......: 0.00%   0 out of 4320

    ✓ start 200
    ✓ has attemptId
    ✓ answers 200
    ✓ no failed feedbacks

    CUSTOM
    answers_duration...............: avg=7.53s   min=7.5s   med=7.53s   max=7.67s    p(90)=7.55s   p(95)=7.56s  
    error_rate.....................: 0.00%  0 out of 2160
    start_duration.................: avg=21.25ms min=2.22ms med=13.93ms max=237.67ms p(90)=42.44ms p(95)=56.62ms

    HTTP
    http_req_duration..............: avg=2.52s   min=326µs  med=14.99ms max=7.67s    p(90)=7.54s   p(95)=7.55s  
      { expected_response:true }...: avg=2.52s   min=326µs  med=14.99ms max=7.67s    p(90)=7.54s   p(95)=7.55s  
    http_req_failed................: 0.00%  0 out of 3240
    http_reqs......................: 3240   10.501627/s

    EXECUTION
    iteration_duration.............: avg=8.56s   min=8.51s  med=8.55s   max=8.81s    p(90)=8.6s    p(95)=8.63s  
    iterations.....................: 1080   3.500542/s
    vus............................: 30     min=30        max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 6.7 MB 22 kB/s
    data_sent......................: 3.2 GB 10 MB/s